app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "edited brush teeth"], ["updated_at", "2018-03-24 03:08:22.852535"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.assign_attributes(task_params)
    if task.save

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "download docsets"], ["description", "be prepared to do work on the plane"], ["created_at", "2018-03-24 02:34:51.493093"], ["updated_at", "2018-03-24 02:34:51.493093"]]
---
    task = params[:task]

    new_task = Task.new

    new_task.name = task[:name]
    new_task.description = task[:description]

    if new_task.save

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]
---
  def destroy
    Task.destroy(params[:id])